"""Выбор понятных имен переменных."""

# 1. Имя переменной (идентификатор) должно быть **кратким** и **содержательным**
#
# 2. Метасинтаксически переменные используются, когда необходимо обобщенное имя, когда само имя несущественно. В Python чаще всего используют:
# ```
# foo, bar, spam, eggs, bacon и ham
# ```
#
# 3. Схемы регистра имен:
# 	* snake_case - змеиный регистр
# 	* camelCase - верблюжий регистр
# 	* PascalCase - схема Pascal
#
# 	* kebab-case - схема Kebab - в Питон обычно не используется

# ### Правила формирования имен PEP 8 ###
# * Все буквы должны быть буквами ASCII — то есть латинскими буквами верхнего и нижнего регистров без диакритических знаков.
# * Имена модулей должны быть короткими и состоять только из букв нижнего регистра.
# * Имена классов необходимо записывать в схеме Pascal.
# * Имена констант следует записывать в верхнем змеином регистре.
# * Имена функций, методов и переменных записывают в нижнем змеином регистре.
# * Первый аргумент методов всегда должен называться self в нижнем регистре.
# * Первый аргумент методов классов всегда должен называться cls в нижнем регистре.
# * Приватные атрибуты классов всегда начинают с символа подчеркивания ( _ ).
# * Публичные атрибуты классов никогда не начинают с символа подчеркивания ( _ ).
