"""Issue #8 Контрибьютинг в Open Source.

https://github.com/SENATOROVAI/intro-cs/issues/8
"""

# 1. Есть ли у него лицензия? Обычно в корне репозитория находится файл LICENSE.
# Да
#
# 2. Напишите название понравившейся компании и ссылку на репозиторий
# First Contributions
# https://github.com/firstcontributions/first-contributions
#
# 3. Проект активно принимает стороннюю помощь?
# Да
#
# 4. Напишите второе улучшение которое вы сделали
# Внес себя в список контрибьюторов.
#
# 5. Посмотрите на коммиты в основной ветке, напишите общее количество
# 12065
#
# 6. Когда был последний коммит?
# 1 час назад
#
# 7. Сколько контрибьюторов у проекта?
# Более 5000
#
# 8. Как часто люди коммитят в репозиторий? (На GitHub выяснить это можно, кликнув по ссылке «Commits» в верхней панели.)
# Несколько коммитов в час
#
# 9. Сколько сейчас открытых ишью?
# 56
#
# 10. Быстро ли мейнтейнеры реагируют на ишью после того, когда они открываются?
# Быстро
#
# 11. Ведётся ли активное обсуждение ишью?
# При необходимости
#
# 12. Есть ли недавно созданные ишью?
# Да
#
# 13. Есть ли закрытые ишью? (На странице Issues GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые ишью.)
# Да
#
# 14. Сколько сейчас открытых пул-реквестов?
# 53
#
# 15. Быстро ли мейнтейнеры реагируют на пул-реквесты после их открытия?
# Мой влили через несколько минут
#
# 16. Ведётся ли активное обсуждение пул-реквестов?
# Нет
#
# 17. Есть ли недавно отправленные пул-реквесты?
# Да
#
# 18. Как давно были объединены пул-реквесты? (На странице Pull Request GitHub-репозитория щелкните на вкладку «Closed», чтобы увидеть закрытые пул-реквесты.)
# Час назад
